# Width Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..Width Property
ImageType Class See Also
---
The horizontal size of the image
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double Width { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Width As Double
	Get
```

Visual C++
---
```text
public:
property double Width {
	double get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace